---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleColorSettingsType
source: html/5f1e5c03-407b-53fc-8902-1228734907ff.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleColorSettingsType

Defines types for color settings of analysis display style.

## Syntax (C#)
```csharp
public enum AnalysisDisplayStyleColorSettingsType
```